{
  "intents": [
    {
      "tag": "saldacoes",
      "patterns": [
        "Oi",
        "Olá",
        "Tudo bem com você?",
        "Tem alguém ai?",
        "Bom dia",
        "Boa tarde"
      ],
      "responses": [
        "Olá!",
        "Olá, como posso ajuda-lo com a sua BitDogLab hojê?",
        "Oi, como posso ajuda-lo com a sua BitDogLab hojê?"
      ]
    },
    {
      "tag": "despedida",
      "patterns": ["Tchau", "Até mais", "Goodbye"],
      "responses": [
        "Obrigado por utilizar a BitDogLab, até mais"
      ]
    },
    {
      "tag": "agradecimento",
      "patterns": ["Obrigado", "Muito obrigado", "Valeu", "vlw", "obg"],
      "responses": ["Fico feliz em ajudar!", "Imagina, fico feliz em ajudar!"]
    },
    {
      "tag": "sobre",
      "patterns": [
        "O que é a BitDogLab?",
        "BitDogLab",
	      "projeto BitDogLab?"
      ],
      "responses": [
        "Objetivo do projeto: A BitDogLab, uma iniciativa do Projeto Escola 40 da Unicamp, é uma ferramenta educacional dedicada à eletrônica e computação. Baseada na Raspberry Pi Pico H ou W, permite aos usuários explorar, montar e programar utilizando componentes montados na sua placa e também externos conectados de forma organizada e segura. Selecionados meticulosamente, os componentes promovem um aprendizado mão na massa, incentivando os usuários a aprimorar habilidades de programação e eletrônica de maneira sinérgica e progressiva. Esta plataforma enriquecedora oferece uma experiência vibrante, imergindo os usuários em um ambiente de aprendizado colorido, auditivo e sinestésico. Além disso, a BitDogLab é otimizada para programação assistida por modelos de linguagem de grande escala (LLM), como o ChatGPT, facilitando um aprendizado mais intuitivo e assistido por um incansável tutor. O BitDogLab é uma ferramenta para ensinar jovens a programar. É um diferencial da BitDogLab é que seu projeto é totalmente aberto, permitindo que seja livremente copiada, fabricada, montada e melhorada pelos usuários"
      ]
    },
    {
      "tag": "funcional",
      "patterns": [
        "Para que serve a BitDogLab?",
        "Como a BitDogLab funciona?",
      	"Para que serve",
      	"Como funciona?"
      ],
      "responses": [
        "Funcionalidades da placa BitDogLab: As principais características da BitDogLab e as suas potenciais possibilidades são resumidas a seguir: Experiência Prática: O projeto da BitDogLab é compartilhado de forma aberta e gratuita, permitindo que os usuários montem sua própria placa, soldando componente a componente enquanto progridem na programação. Isso proporciona um aprendizado que vai além da teoria e oferece uma experiência valiosa em montagem de placas eletrônicas. Programação Intuitiva: O uso da IDE Thonny Editor, em conjunto com o MicroPython, oferece uma plataforma amigável, que permite aos iniciantes se aprofundarem na programação sem medo. Open Source Learning: Sendo o projeto integralmente código aberto, ele convida entusiastas e profissionais a explorar, utilizar, modificar e aprimorar o design original de forma contínua. A colaboração da comunidade pode expandir o escopo do projeto, possibilitando adaptações para outros microcontroladores, como os da Expressif ou STMicro. Mergulho na Inteligência Artificial: Com o suporte do IABOT, os estudantes não só têm suas dúvidas resolvidas, mas também são introduzidos ao fascinante mundo da IA, abrindo portas para futuras aprendizagens nesta área. Ferramenta agregadora para aplicar a metodologia STEAM de ensino: A BitDogLab vai além de ser apenas um projeto de uma placa de circuito impresso. Ela representa uma poderosa ferramenta educativa que converge diversas disciplinas. Através dela, os conceitos de Ciência, Tecnologia, Engenharia, Artes e Matemática (STEAM) são unificados, proporcionando uma abordagem holística ao aprendizado. Com esta integração, os estudantes podem visualizar como esses campos se entrelaçam na prática, incentivando a inovação e a criatividade. Recursos disponíveis: PCB da BitDogLab: Esta placa de circuito é a alma do projeto. Neste repositório você pode obter os arquivos de fabricação. O projeto BitDogLab está disponível gratuitamente no GitHub para quem deseja acessá-lo e contribuir. Atualmente, estamos na quarta versão de desenvolvimento, que trouxe inovações significativas: foram incorporados conectores específicos para os dois canais I2C e, além disso, agora é possível carregar a bateria da placa através de um mini painel solar, ampliando suas possibilidades de uso e sustentabilidade."
        
      ]
    },
    {
      "tag": "código",
      "patterns": [
        "Como faço para acender o LED RGB",
        "Como faço para acender o LED",
        "Acender LED",
        "Código simples",
      	"Exemplo de código simples",
      	"Exemplo de código",
      	"Exemplo"
      ],
      "responses": [
        "Um exemplo simples de código para acender LEDs na placa BitDogLab. \n from machine import Pin \n led = Pin(13, Pin.OUT) \n led.high() \n time.sleep(3) \n led.low()"
      ]
    },
    {
      "tag": "BIH",
      "patterns": [
        "Banco de informações de hardware",
      	"hardware",
        "Componetes Fisicos",
        "Componentes de hardware",
        "Conexão de hardware",
        "Configurações hardware"
      ],
      "responses": [
        "Conexões e Configurações de Hardware: \n \n As conexões da Raspberry Pi pico com outros componentes estão realizadas da seguinte forma: \n Um LED RGB catodo comum tem o eletrodo do vermelho lidado no GPIO 12 através de um resistor de 220 ohm, o pino de verde está ligado no GPIO 13 também através de um resistor de 220 ohm e o pino do azul no GPIO 11 através de um resistor de 150 ohm. \n Um botão, identificado como Botão A, está conectado no GPIO5 da Raspberry Pi Pico. O outro terminal do botão está conectado ao GND da placa. \n Outro botão, identificado como Botão B, está conectado no GPIO6 da Raspberry pi pico. O outro terminal do botão também está conectado ao GND da placa.  \n Deve-se portanto nos GPIO5 e 6 configurar resistores de pull-up internos. Isso significa que o estado padrão dos pinos será HIGH (alto), e quando o botão for pressionado, o estado mudará para LOW (baixo). Outro botão, identificado como RESET, está conectado no RUN (pino número 30) da Raspberry pi pico. O outro terminal do botão também está conectado ao GND da placa. \n \n Um buzzer passivo, identificado como Buzzer A, está conectado - através de um transistor - no GPIO21 da Raspberry pi pico. Outro buzzer passivo, identificado como Buzzer B, está conectado no GPIO8 da Raspberry pi pico. \n O pino in de uma matriz de LEDs 5050 RGB de 5 linhas por 5 colunas tipo WS2812B (Neopixel) está conectada ao GPIO7. \n Um joystick analógico tipo KY023 tem a saída VRy conectada ao GPIO26 e a saída VRx ao GPIO27. Seu botão SW está conectada ao GPIO22, o outro terminal do botão está no GND. \n Um display OLED 128 colunas por  x 64 linhas de 0,96 polegadas com comunicação I2C, tem seu pino SDA conectado ao GPIO14 e o pino SCL com o GPIO15, estes pinos são do canal I2C0. Esse display (normalmente configurado no endereço 0x3C)  exige o carregamento da biblioteca ssd1306.py na Raspiberry pi pico. \n Um módulo microfone de eletreto com saída analógica está conectado ao GP28. O nível médio do sinal de saída é 1,65 V. A tensão na saída do módulo varia de 0V até 3,3V \n Um conector Insulation-Displacement Connector (ICD) box de 14 pinos é usado para expansão de hardware e está assim conectado com a Raspberry Pi Pico: pino 1 com o GND, pino 2 com o 5V, pino 3 com 3V3, pino 4 com GPIO10, pino 5 com o GPIO28, pino 6 com o GPIO9, pino 7 com GND analogico. pino 8 com o GPIO4, pino 9 com o GPIO17, pino 10 com o GND, pino 11 com o GPIO16, pino 12 com GPIO19, pino 13 com o GND, pino 14 com o GPIO18.  Para uma comunicação SPI usamos os GPIO16 (RX), GPIO17(CSn), GP18 (SCK) e GP19 (TX). \n Uma barra de terminais que permite a conexão de garras do tipo jacaré está assim conectada ao Raspberry Pi Pico: os eletrodos DIG 0, 1, 2 e 3 estão conectados aos GPIOs 3, 2, 1 e 0, respectivamente. Além disso esta barra de terminais possui mais 5 eletrodos conectados ao: GND analógico, GPIO 28, GND, 3V3 e 5V da Raspberry Pi Pico. Um conector de 4 pinos está posicionado na extremidade superior  da placa, dando acesso aos GPIO0 (SDA) e GPIO1(SCL) além do 3V3 e GND. Este conector é nomeado de I2C 0 e está do lado direito. Um outro conector de 4 pinos está posicionado na extremidade da placa, dando acesso aos GPIO2 (SDA) e GPIO3(SCL) além do 3V3 e GND. Este conector é nomeado de I2C 1 e está do lado esquerdo."
      ]
    
    }
  ] 
}
